#include <stdint.h>

int main (void){
*(uint32_t*)(0x40023800UL + 0x30UL) |= 0x02; //включение тактирования GPIOB
*(uint32_t*)(0x40020400UL + 0x00UL) |= 0x4000; // 7пин на вывод
*(uint32_t*)(0x40020400UL + 0x04UL) |= 0x00; // 7пин push-pull
*(uint32_t*)(0x40020400UL + 0x08UL) |= 0x4000; // 7пин средняя скорость
*(uint32_t*)(0x40020400UL + 0x00CUL) |= 0x00; // 7пин отключение PU/PD резисторов
*(uint32_t*)(0x40020400UL + 0x18UL) |= 0x800000; // 7пин - 1 (0DR)

while(1){
    if(*(uint32_t*)(0x40020800UL + 0x10UL) & 0x1000 !=0)
    {
    
        *(uint32_t*)(0x40020400UL + 0x18UL) |= 0x80; // 7пин - 1 (0DR)
    }
    else
    {
        *(uint32_t*)(0x40020400UL + 0x18UL) |= 0x800000; // 7пин - 1 (0DR)
    }
*(uint32_t*)(0x40020400UL + 0x18UL) |= 0x80; // 7пин - 1 (0DR)
}

}